GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f45q43.inc
        LIST

;==========================================================================
; Build date : Jan 06 2020
;  MPASM PIC18F45Q43 processor include
; 
;  (c) Copyright 1999-2020 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18F45Q43 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18F45Q43
;       2. LIST directive in the source file
;               LIST   P=PIC18F45Q43
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18F45Q43
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2

FAST             EQU  1

W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
CLKRCON          EQU  H'0039'
CLKRCLK          EQU  H'003A'
NVMCON0          EQU  H'0040'
NVMCON1          EQU  H'0041'
NVMLOCK          EQU  H'0042'
NVMADR           EQU  H'0043'
NVMADRL          EQU  H'0043'
NVMADRH          EQU  H'0044'
NVMADRU          EQU  H'0045'
NVMDAT           EQU  H'0046'
NVMDATL          EQU  H'0046'
NVMDATH          EQU  H'0047'
VREGCON          EQU  H'0048'
BORCON           EQU  H'0049'
HLVDCON0         EQU  H'004A'
HLVDCON1         EQU  H'004B'
ZCDCON           EQU  H'004C'
PMD0             EQU  H'0060'
PMD1             EQU  H'0061'
PMD3             EQU  H'0063'
PMD4             EQU  H'0064'
PMD5             EQU  H'0065'
PMD6             EQU  H'0066'
PMD7             EQU  H'0067'
PMD8             EQU  H'0068'
MD1CON0          EQU  H'006A'
MD1CON1          EQU  H'006B'
MD1SRC           EQU  H'006C'
MD1CARL          EQU  H'006D'
MD1CARH          EQU  H'006E'
CMOUT            EQU  H'006F'
CM1CON0          EQU  H'0070'
CM1CON1          EQU  H'0071'
CM1NCH           EQU  H'0072'
CM1PCH           EQU  H'0073'
CM2CON0          EQU  H'0074'
CM2CON1          EQU  H'0075'
CM2NCH           EQU  H'0076'
CM2PCH           EQU  H'0077'
WDTCON0          EQU  H'0078'
WDTCON1          EQU  H'0079'
WDTPS            EQU  H'007A'
WDTPSL           EQU  H'007A'
WDTPSH           EQU  H'007B'
WDTTMR           EQU  H'007C'
DAC1DAT          EQU  H'007D'
DAC1DATL         EQU  H'007D'
DAC1CON          EQU  H'007F'
SPI1RXB          EQU  H'0080'
SPI1TXB          EQU  H'0081'
SPI1TCNT         EQU  H'0082'
SPI1TCNTL        EQU  H'0082'
SPI1TCNTH        EQU  H'0083'
SPI1CON0         EQU  H'0084'
SPI1CON1         EQU  H'0085'
SPI1CON2         EQU  H'0086'
SPI1STATUS       EQU  H'0087'
SPI1TWIDTH       EQU  H'0088'
SPI1BAUD         EQU  H'0089'
SPI1INTF         EQU  H'008A'
SPI1INTE         EQU  H'008B'
SPI1CLK          EQU  H'008C'
SPI2RXB          EQU  H'008D'
SPI2TXB          EQU  H'008E'
SPI2TCNT         EQU  H'008F'
SPI2TCNTL        EQU  H'008F'
SPI2TCNTH        EQU  H'0090'
SPI2CON0         EQU  H'0091'
SPI2CON1         EQU  H'0092'
SPI2CON2         EQU  H'0093'
SPI2STATUS       EQU  H'0094'
SPI2TWIDTH       EQU  H'0095'
SPI2BAUD         EQU  H'0096'
SPI2INTF         EQU  H'0097'
SPI2INTE         EQU  H'0098'
SPI2CLK          EQU  H'0099'
ACTCON           EQU  H'00AC'
OSCCON1          EQU  H'00AD'
OSCCON2          EQU  H'00AE'
OSCCON3          EQU  H'00AF'
OSCTUNE          EQU  H'00B0'
OSCFREQ          EQU  H'00B1'
OSCFRQ           EQU  H'00B1'
OSCSTAT          EQU  H'00B2'
OSCSTAT1         EQU  H'00B2'
OSCEN            EQU  H'00B3'
PRLOCK           EQU  H'00B4'
SCANPR           EQU  H'00B5'
DMA1PR           EQU  H'00B6'
DMA2PR           EQU  H'00B7'
DMA3PR           EQU  H'00B8'
DMA4PR           EQU  H'00B9'
DMA5PR           EQU  H'00BA'
DMA6PR           EQU  H'00BB'
MAINPR           EQU  H'00BE'
ISRPR            EQU  H'00BF'
CLCDATA          EQU  H'00D4'
CLCSELECT        EQU  H'00D5'
CLCnCON          EQU  H'00D6'
CLCnPOL          EQU  H'00D7'
CLCnSEL0         EQU  H'00D8'
CLCnSEL1         EQU  H'00D9'
CLCnSEL2         EQU  H'00DA'
CLCnSEL3         EQU  H'00DB'
CLCnGLS0         EQU  H'00DC'
CLCnGLS1         EQU  H'00DD'
CLCnGLS2         EQU  H'00DE'
CLCnGLS3         EQU  H'00DF'
DMASELECT        EQU  H'00E8'
DMAnBUF          EQU  H'00E9'
DMAnDCNT         EQU  H'00EA'
DMAnDCNTL        EQU  H'00EA'
DMAnDCNTH        EQU  H'00EB'
DMAnDPTR         EQU  H'00EC'
DMAnDPTRL        EQU  H'00EC'
DMAnDPTRH        EQU  H'00ED'
DMAnDSZ          EQU  H'00EE'
DMAnDSZL         EQU  H'00EE'
DMAnDSZH         EQU  H'00EF'
DMAnDSA          EQU  H'00F0'
DMAnDSAL         EQU  H'00F0'
DMAnDSAH         EQU  H'00F1'
DMAnSCNT         EQU  H'00F2'
DMAnSCNTL        EQU  H'00F2'
DMAnSCNTH        EQU  H'00F3'
DMAnSPTR         EQU  H'00F4'
DMAnSPTRL        EQU  H'00F4'
DMAnSPTRH        EQU  H'00F5'
DMAnSPTRU        EQU  H'00F6'
DMAnSSZ          EQU  H'00F7'
DMAnSSZL         EQU  H'00F7'
DMAnSSZH         EQU  H'00F8'
DMAnSSA          EQU  H'00F9'
DMAnSSAL         EQU  H'00F9'
DMAnSSAH         EQU  H'00FA'
DMAnSSAU         EQU  H'00FB'
DMAnCON0         EQU  H'00FC'
DMAnCON1         EQU  H'00FD'
DMAnAIRQ         EQU  H'00FE'
DMAnSIRQ         EQU  H'00FF'
PPSLOCK          EQU  H'0200'
RA0PPS           EQU  H'0201'
RA1PPS           EQU  H'0202'
RA2PPS           EQU  H'0203'
RA3PPS           EQU  H'0204'
RA4PPS           EQU  H'0205'
RA5PPS           EQU  H'0206'
RA6PPS           EQU  H'0207'
RA7PPS           EQU  H'0208'
RB0PPS           EQU  H'0209'
RB1PPS           EQU  H'020A'
RB2PPS           EQU  H'020B'
RB3PPS           EQU  H'020C'
RB4PPS           EQU  H'020D'
RB5PPS           EQU  H'020E'
RB6PPS           EQU  H'020F'
RB7PPS           EQU  H'0210'
RC0PPS           EQU  H'0211'
RC1PPS           EQU  H'0212'
RC2PPS           EQU  H'0213'
RC3PPS           EQU  H'0214'
RC4PPS           EQU  H'0215'
RC5PPS           EQU  H'0216'
RC6PPS           EQU  H'0217'
RC7PPS           EQU  H'0218'
RD0PPS           EQU  H'0219'
RD1PPS           EQU  H'021A'
RD2PPS           EQU  H'021B'
RD3PPS           EQU  H'021C'
RD4PPS           EQU  H'021D'
RD5PPS           EQU  H'021E'
RD6PPS           EQU  H'021F'
RD7PPS           EQU  H'0220'
RE0PPS           EQU  H'0221'
RE1PPS           EQU  H'0222'
RE2PPS           EQU  H'0223'
INT0PPS          EQU  H'023E'
INT1PPS          EQU  H'023F'
INT2PPS          EQU  H'0240'
T0CKIPPS         EQU  H'0241'
T1CKIPPS         EQU  H'0242'
T1GPPS           EQU  H'0243'
T3CKIPPS         EQU  H'0244'
T3GPPS           EQU  H'0245'
T5CKIPPS         EQU  H'0246'
T5GPPS           EQU  H'0247'
T2INPPS          EQU  H'0248'
T4INPPS          EQU  H'0249'
T6INPPS          EQU  H'024A'
CCP1PPS          EQU  H'024F'
CCP2PPS          EQU  H'0250'
CCP3PPS          EQU  H'0251'
PWM1ERSPPS       EQU  H'0253'
PWM2ERSPPS       EQU  H'0254'
PWM3ERSPPS       EQU  H'0255'
PWMIN0PPS        EQU  H'0257'
PWMIN1PPS        EQU  H'0258'
SMT1WINPPS       EQU  H'0259'
SMT1SIGPPS       EQU  H'025A'
CWG1INPPS        EQU  H'025B'
CWG1PPS          EQU  H'025B'
CWG2INPPS        EQU  H'025C'
CWG2PPS          EQU  H'025C'
CWG3INPPS        EQU  H'025D'
CWG3PPS          EQU  H'025D'
MD1CARLPPS       EQU  H'025E'
MDCARLPPS        EQU  H'025E'
MD1CARHPPS       EQU  H'025F'
MDCARHPPS        EQU  H'025F'
MD1SRCPPS        EQU  H'0260'
MDSRCPPS         EQU  H'0260'
CLCIN0PPS        EQU  H'0261'
CLCIN1PPS        EQU  H'0262'
CLCIN2PPS        EQU  H'0263'
CLCIN3PPS        EQU  H'0264'
CLCIN4PPS        EQU  H'0265'
CLCIN5PPS        EQU  H'0266'
CLCIN6PPS        EQU  H'0267'
CLCIN7PPS        EQU  H'0268'
ADACTPPS         EQU  H'0269'
SPI1SCKPPS       EQU  H'026A'
SPI1SDIPPS       EQU  H'026B'
SPI1SSPPS        EQU  H'026C'
SPI2SCKPPS       EQU  H'026D'
SPI2SDIPPS       EQU  H'026E'
SPI2SSPPS        EQU  H'026F'
I2C1SDAPPS       EQU  H'0270'
I2C1SCLPPS       EQU  H'0271'
U1RXPPS          EQU  H'0272'
U1CTSPPS         EQU  H'0273'
U2RXPPS          EQU  H'0274'
U2CTSPPS         EQU  H'0275'
U3RXPPS          EQU  H'0276'
U3CTSPPS         EQU  H'0277'
U4RXPPS          EQU  H'0278'
U4CTSPPS         EQU  H'0279'
U5RXPPS          EQU  H'027A'
U5CTSPPS         EQU  H'027B'
RC4I2C           EQU  H'0286'
RC3I2C           EQU  H'0287'
RB2I2C           EQU  H'0288'
RB1I2C           EQU  H'0289'
I2C1RXB          EQU  H'028B'
I2C1TXB          EQU  H'028C'
I2C1CNT          EQU  H'028D'
I2C1ADB0         EQU  H'028E'
I2C1ADB1         EQU  H'028F'
I2C1ADR0         EQU  H'0290'
I2C1ADR1         EQU  H'0291'
I2C1ADR2         EQU  H'0292'
I2C1ADR3         EQU  H'0293'
I2C1CON0         EQU  H'0294'
I2C1CON1         EQU  H'0295'
I2C1CON2         EQU  H'0296'
I2C1ERR          EQU  H'0297'
I2C1STAT0        EQU  H'0298'
I2C1STAT1        EQU  H'0299'
I2C1PIR          EQU  H'029A'
I2C1PIE          EQU  H'029B'
I2C1CLK          EQU  H'029C'
I2C1BTO          EQU  H'029D'
U1RXB            EQU  H'02A1'
U1RXBL           EQU  H'02A1'
U1RXCHK          EQU  H'02A2'
U1TXB            EQU  H'02A3'
U1TXBL           EQU  H'02A3'
U1TXCHK          EQU  H'02A4'
U1P1             EQU  H'02A5'
U1P1L            EQU  H'02A5'
U1P1H            EQU  H'02A6'
U1P2             EQU  H'02A7'
U1P2L            EQU  H'02A7'
U1P2H            EQU  H'02A8'
U1P3             EQU  H'02A9'
U1P3L            EQU  H'02A9'
U1P3H            EQU  H'02AA'
U1CON0           EQU  H'02AB'
U1CON1           EQU  H'02AC'
U1CON2           EQU  H'02AD'
U1BRG            EQU  H'02AE'
U1BRGL           EQU  H'02AE'
U1BRGH           EQU  H'02AF'
U1FIFO           EQU  H'02B0'
U1UIR            EQU  H'02B1'
U1ERRIR          EQU  H'02B2'
U1ERRIE          EQU  H'02B3'
U2RXB            EQU  H'02B4'
U2RXBL           EQU  H'02B4'
U2TXB            EQU  H'02B6'
U2TXBL           EQU  H'02B6'
U2P1             EQU  H'02B8'
U2P1L            EQU  H'02B8'
U2P2             EQU  H'02BA'
U2P2L            EQU  H'02BA'
U2P3             EQU  H'02BC'
U2P3L            EQU  H'02BC'
U2CON0           EQU  H'02BE'
U2CON1           EQU  H'02BF'
U2CON2           EQU  H'02C0'
U2BRG            EQU  H'02C1'
U2BRGL           EQU  H'02C1'
U2BRGH           EQU  H'02C2'
U2FIFO           EQU  H'02C3'
U2UIR            EQU  H'02C4'
U2ERRIR          EQU  H'02C5'
U2ERRIE          EQU  H'02C6'
U3RXB            EQU  H'02C7'
U3RXBL           EQU  H'02C7'
U3TXB            EQU  H'02C9'
U3TXBL           EQU  H'02C9'
U3P1             EQU  H'02CB'
U3P1L            EQU  H'02CB'
U3P2             EQU  H'02CD'
U3P2L            EQU  H'02CD'
U3P3             EQU  H'02CF'
U3P3L            EQU  H'02CF'
U3CON0           EQU  H'02D1'
U3CON1           EQU  H'02D2'
U3CON2           EQU  H'02D3'
U3BRG            EQU  H'02D4'
U3BRGL           EQU  H'02D4'
U3BRGH           EQU  H'02D5'
U3FIFO           EQU  H'02D6'
U3UIR            EQU  H'02D7'
U3ERRIR          EQU  H'02D8'
U3ERRIE          EQU  H'02D9'
U4RXB            EQU  H'02DA'
U4RXBL           EQU  H'02DA'
U4TXB            EQU  H'02DC'
U4TXBL           EQU  H'02DC'
U4P1             EQU  H'02DE'
U4P1L            EQU  H'02DE'
U4P2             EQU  H'02E0'
U4P2L            EQU  H'02E0'
U4P3             EQU  H'02E2'
U4P3L            EQU  H'02E2'
U4CON0           EQU  H'02E4'
U4CON1           EQU  H'02E5'
U4CON2           EQU  H'02E6'
U4BRG            EQU  H'02E7'
U4BRGL           EQU  H'02E7'
U4BRGH           EQU  H'02E8'
U4FIFO           EQU  H'02E9'
U4UIR            EQU  H'02EA'
U4ERRIR          EQU  H'02EB'
U4ERRIE          EQU  H'02EC'
U5RXB            EQU  H'02ED'
U5RXBL           EQU  H'02ED'
U5TXB            EQU  H'02EF'
U5TXBL           EQU  H'02EF'
U5P1             EQU  H'02F1'
U5P1L            EQU  H'02F1'
U5P2             EQU  H'02F3'
U5P2L            EQU  H'02F3'
U5P3             EQU  H'02F5'
U5P3L            EQU  H'02F5'
U5CON0           EQU  H'02F7'
U5CON1           EQU  H'02F8'
U5CON2           EQU  H'02F9'
U5BRG            EQU  H'02FA'
U5BRGL           EQU  H'02FA'
U5BRGH           EQU  H'02FB'
U5FIFO           EQU  H'02FC'
U5UIR            EQU  H'02FD'
U5ERRIR          EQU  H'02FE'
U5ERRIE          EQU  H'02FF'
SMT1TMR          EQU  H'0300'
SMT1TMRL         EQU  H'0300'
SMT1TMRH         EQU  H'0301'
SMT1TMRU         EQU  H'0302'
SMT1CPR          EQU  H'0303'
SMT1CPRL         EQU  H'0303'
SMT1CPRH         EQU  H'0304'
SMT1CPRU         EQU  H'0305'
SMT1CPW          EQU  H'0306'
SMT1CPWL         EQU  H'0306'
SMT1CPWH         EQU  H'0307'
SMT1CPWU         EQU  H'0308'
SMT1PR           EQU  H'0309'
SMT1PRL          EQU  H'0309'
SMT1PRH          EQU  H'030A'
SMT1PRU          EQU  H'030B'
SMT1CON0         EQU  H'030C'
SMT1CON1         EQU  H'030D'
SMT1STAT         EQU  H'030E'
SMT1CLK          EQU  H'030F'
SMT1SIG          EQU  H'0310'
SMT1WIN          EQU  H'0311'
TMR0             EQU  H'0318'
TMR0L            EQU  H'0318'
PR0              EQU  H'0319'
TMR0H            EQU  H'0319'
T0CON0           EQU  H'031A'
T0CON1           EQU  H'031B'
TMR1L            EQU  H'031C'
TMR1H            EQU  H'031D'
T1CON            EQU  H'031E'
TMR1CON          EQU  H'031E'
T1GCON           EQU  H'031F'
TMR1GCON         EQU  H'031F'
T1GATE           EQU  H'0320'
TMR1GATE         EQU  H'0320'
T1CLK            EQU  H'0321'
TMR1CLK          EQU  H'0321'
T2TMR            EQU  H'0322'
TMR2             EQU  H'0322'
PR2              EQU  H'0323'
T2PR             EQU  H'0323'
T2CON            EQU  H'0324'
T2HLT            EQU  H'0325'
T2CLK            EQU  H'0326'
T2CLKCON         EQU  H'0326'
T2RST            EQU  H'0327'
TMR3L            EQU  H'0328'
TMR3H            EQU  H'0329'
T3CON            EQU  H'032A'
TMR3CON          EQU  H'032A'
T3GCON           EQU  H'032B'
TMR3GCON         EQU  H'032B'
T3GATE           EQU  H'032C'
TMR3GATE         EQU  H'032C'
T3CLK            EQU  H'032D'
TMR3CLK          EQU  H'032D'
T4TMR            EQU  H'032E'
TMR4             EQU  H'032E'
PR4              EQU  H'032F'
T4PR             EQU  H'032F'
T4CON            EQU  H'0330'
T4HLT            EQU  H'0331'
T4CLK            EQU  H'0332'
T4CLKCON         EQU  H'0332'
T4RST            EQU  H'0333'
TMR5L            EQU  H'0334'
TMR5H            EQU  H'0335'
T5CON            EQU  H'0336'
TMR5CON          EQU  H'0336'
T5GCON           EQU  H'0337'
TMR5GCON         EQU  H'0337'
T5GATE           EQU  H'0338'
TMR5GATE         EQU  H'0338'
T5CLK            EQU  H'0339'
TMR5CLK          EQU  H'0339'
T6TMR            EQU  H'033A'
TMR6             EQU  H'033A'
PR6              EQU  H'033B'
T6PR             EQU  H'033B'
T6CON            EQU  H'033C'
T6HLT            EQU  H'033D'
T6CLK            EQU  H'033E'
T6CLKCON         EQU  H'033E'
T6RST            EQU  H'033F'
CCPR1            EQU  H'0340'
CCPR1L           EQU  H'0340'
CCPR1H           EQU  H'0341'
CCP1CON          EQU  H'0342'
CCP1CAP          EQU  H'0343'
CCPR2            EQU  H'0344'
CCPR2L           EQU  H'0344'
CCPR2H           EQU  H'0345'
CCP2CON          EQU  H'0346'
CCP2CAP          EQU  H'0347'
CCPR3            EQU  H'0348'
CCPR3L           EQU  H'0348'
CCPR3H           EQU  H'0349'
CCP3CON          EQU  H'034A'
CCP3CAP          EQU  H'034B'
CCPTMRS0         EQU  H'034C'
CRCDATA          EQU  H'034F'
CRCDATL          EQU  H'034F'
CRCDATH          EQU  H'0350'
CRCACC           EQU  H'0351'
CRCACCL          EQU  H'0351'
CRCACCH          EQU  H'0352'
CRCSHFT          EQU  H'0353'
CRCSHIFTL        EQU  H'0353'
CRCSHIFTH        EQU  H'0354'
CRCXOR           EQU  H'0355'
CRCXORL          EQU  H'0355'
CRCXORH          EQU  H'0356'
CRCCON0          EQU  H'0357'
CRCCON1          EQU  H'0358'
SCANLADR         EQU  H'035A'
SCANLADRL        EQU  H'035A'
SCANLADRH        EQU  H'035B'
SCANLADRU        EQU  H'035C'
SCANHADR         EQU  H'035D'
SCANHADRL        EQU  H'035D'
SCANHADRH        EQU  H'035E'
SCANHADRU        EQU  H'035F'
SCANCON0         EQU  H'0360'
SCANTRIG         EQU  H'0361'
IPR0             EQU  H'0362'
IPR1             EQU  H'0363'
IPR2             EQU  H'0364'
IPR3             EQU  H'0365'
IPR4             EQU  H'0366'
IPR5             EQU  H'0367'
IPR6             EQU  H'0368'
IPR7             EQU  H'0369'
IPR8             EQU  H'036A'
IPR9             EQU  H'036B'
IPR10            EQU  H'036C'
IPR11            EQU  H'036D'
IPR12            EQU  H'036E'
IPR13            EQU  H'036F'
IPR14            EQU  H'0370'
IPR15            EQU  H'0371'
STATUS_CSHAD     EQU  H'0373'
WREG_CSHAD       EQU  H'0374'
BSR_CSHAD        EQU  H'0375'
SHADCON          EQU  H'0376'
STATUS_SHAD      EQU  H'0377'
WREG_SHAD        EQU  H'0378'
BSR_SHAD         EQU  H'0379'
PCLATH_SHAD      EQU  H'037A'
PCLATU_SHAD      EQU  H'037B'
FSR0L_SHAD       EQU  H'037C'
FSR0SH           EQU  H'037C'
FSR0H_SHAD       EQU  H'037D'
FSR1L_SHAD       EQU  H'037E'
FSR1SH           EQU  H'037E'
FSR1H_SHAD       EQU  H'037F'
FSR2L_SHAD       EQU  H'0380'
FSR2SH           EQU  H'0380'
FSR2H_SHAD       EQU  H'0381'
PRODL_SHAD       EQU  H'0382'
PRODSH           EQU  H'0382'
PRODH_SHAD       EQU  H'0383'
CWG1CLK          EQU  H'03BC'
CWG1CLKCON       EQU  H'03BC'
CWG1DAT          EQU  H'03BD'
CWG1ISM          EQU  H'03BD'
CWG1DBR          EQU  H'03BE'
CWG1DBF          EQU  H'03BF'
CWG1CON0         EQU  H'03C0'
CWG1CON1         EQU  H'03C1'
CWG1AS0          EQU  H'03C2'
CWG1AS1          EQU  H'03C3'
CWG1STR          EQU  H'03C4'
CWG2CLK          EQU  H'03C5'
CWG2CLKCON       EQU  H'03C5'
CWG2DAT          EQU  H'03C6'
CWG2ISM          EQU  H'03C6'
CWG2DBR          EQU  H'03C7'
CWG2DBF          EQU  H'03C8'
CWG2CON0         EQU  H'03C9'
CWG2CON1         EQU  H'03CA'
CWG2AS0          EQU  H'03CB'
CWG2AS1          EQU  H'03CC'
CWG2STR          EQU  H'03CD'
CWG3CLK          EQU  H'03CE'
CWG3CLKCON       EQU  H'03CE'
CWG3DAT          EQU  H'03CF'
CWG3ISM          EQU  H'03CF'
CWG3DBR          EQU  H'03D0'
CWG3DBF          EQU  H'03D1'
CWG3CON0         EQU  H'03D2'
CWG3CON1         EQU  H'03D3'
CWG3AS0          EQU  H'03D4'
CWG3AS1          EQU  H'03D5'
CWG3STR          EQU  H'03D6'
FVRCON           EQU  H'03D7'
ADCP             EQU  H'03D8'
ADCPCON          EQU  H'03D8'
ADLTH            EQU  H'03D9'
ADLTHL           EQU  H'03D9'
ADLTHH           EQU  H'03DA'
ADUTH            EQU  H'03DB'
ADUTHL           EQU  H'03DB'
ADUTHH           EQU  H'03DC'
ADERR            EQU  H'03DD'
ADERRL           EQU  H'03DD'
ADERRH           EQU  H'03DE'
ADSTPT           EQU  H'03DF'
ADSTPTL          EQU  H'03DF'
ADSTPTH          EQU  H'03E0'
ADFLTR           EQU  H'03E1'
ADFLTRL          EQU  H'03E1'
ADFLTRH          EQU  H'03E2'
ADACC            EQU  H'03E3'
ADACCL           EQU  H'03E3'
ADACCH           EQU  H'03E4'
ADACCU           EQU  H'03E5'
ADCNT            EQU  H'03E6'
ADRPT            EQU  H'03E7'
ADPREV           EQU  H'03E8'
ADPREVL          EQU  H'03E8'
ADPREVH          EQU  H'03E9'
ADRES            EQU  H'03EA'
ADRESL           EQU  H'03EA'
ADRESH           EQU  H'03EB'
ADPCH            EQU  H'03EC'
ADACQ            EQU  H'03EE'
ADACQL           EQU  H'03EE'
ADACQH           EQU  H'03EF'
ADCAP            EQU  H'03F0'
ADPRE            EQU  H'03F1'
ADPREL           EQU  H'03F1'
ADPREH           EQU  H'03F2'
ADCON0           EQU  H'03F3'
ADCON1           EQU  H'03F4'
ADCON2           EQU  H'03F5'
ADCON3           EQU  H'03F6'
ADSTAT           EQU  H'03F7'
ADREF            EQU  H'03F8'
ADACT            EQU  H'03F9'
ADCLK            EQU  H'03FA'
ANSELA           EQU  H'0400'
WPUA             EQU  H'0401'
ODCONA           EQU  H'0402'
SLRCONA          EQU  H'0403'
INLVLA           EQU  H'0404'
IOCAP            EQU  H'0405'
IOCAN            EQU  H'0406'
IOCAF            EQU  H'0407'
ANSELB           EQU  H'0408'
WPUB             EQU  H'0409'
ODCONB           EQU  H'040A'
SLRCONB          EQU  H'040B'
INLVLB           EQU  H'040C'
IOCBP            EQU  H'040D'
IOCBN            EQU  H'040E'
IOCBF            EQU  H'040F'
ANSELC           EQU  H'0410'
WPUC             EQU  H'0411'
ODCONC           EQU  H'0412'
SLRCONC          EQU  H'0413'
INLVLC           EQU  H'0414'
IOCCP            EQU  H'0415'
IOCCN            EQU  H'0416'
IOCCF            EQU  H'0417'
ANSELD           EQU  H'0418'
WPUD             EQU  H'0419'
ODCOND           EQU  H'041A'
SLRCOND          EQU  H'041B'
INLVLD           EQU  H'041C'
ANSELE           EQU  H'0420'
WPUE             EQU  H'0421'
ODCONE           EQU  H'0422'
SLRCONE          EQU  H'0423'
INLVLE           EQU  H'0424'
IOCEP            EQU  H'0425'
IOCEN            EQU  H'0426'
IOCEF            EQU  H'0427'
NCO1ACC          EQU  H'0440'
NCO1ACCL         EQU  H'0440'
NCO1ACCH         EQU  H'0441'
NCO1ACCU         EQU  H'0442'
NCO1INC          EQU  H'0443'
NCO1INCL         EQU  H'0443'
NCO1INCH         EQU  H'0444'
NCO1INCU         EQU  H'0445'
NCO1CON          EQU  H'0446'
NCO1CLK          EQU  H'0447'
NCO2ACC          EQU  H'0448'
NCO2ACCL         EQU  H'0448'
NCO2ACCH         EQU  H'0449'
NCO2ACCU         EQU  H'044A'
NCO2INC          EQU  H'044B'
NCO2INCL         EQU  H'044B'
NCO2INCH         EQU  H'044C'
NCO2INCU         EQU  H'044D'
NCO2CON          EQU  H'044E'
NCO2CLK          EQU  H'044F'
NCO3ACC          EQU  H'0450'
NCO3ACCL         EQU  H'0450'
NCO3ACCH         EQU  H'0451'
NCO3ACCU         EQU  H'0452'
NCO3INC          EQU  H'0453'
NCO3INCL         EQU  H'0453'
NCO3INCH         EQU  H'0454'
NCO3INCU         EQU  H'0455'
NCO3CON          EQU  H'0456'
NCO3CLK          EQU  H'0457'
IVTLOCK          EQU  H'0459'
IVTAD            EQU  H'045A'
IVTADL           EQU  H'045A'
IVTADH           EQU  H'045B'
IVTADU           EQU  H'045C'
IVTBASE          EQU  H'045D'
IVTBASEL         EQU  H'045D'
IVTBASEH         EQU  H'045E'
IVTBASEU         EQU  H'045F'
PWM1ERS          EQU  H'0460'
PWM1CLK          EQU  H'0461'
PWM1LDS          EQU  H'0462'
PWM1PR           EQU  H'0463'
PWM1PRL          EQU  H'0463'
